run/validationAnalytical/Hsu_Jeng/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

E              E [ 1 -1 -2 0 0 0 0 ] 2.667e7;

nu             nu [ 0 0 0 0 0 0 0 ] 0.3333;

k              k [ 0 1 -1 0 0 0 0 ] 0.001;

K              K [ 1 -1 -2 0 0 0 0 ] 2e9;

Sr             Sr [ 0 0 0 0 0 0 0 ] .975;

p0             p0 [ 1 -1 -2 0 0 0 0 ] 2e5;

gamma          gamma [ 1 -2 -2 0 0 0 0 ] 1e4;

n              n [ 0 0 0 0 0 0 0 ] 0.3;


planeStress     no;

// ************************************************************************* //
