run/validationAnalytical/Hsu_Jeng/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    seaBed
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sides
    {
        type            cyclic;   
    }

    soilDomainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontBack
    {
        type  		 empty;
    }
}

// ************************************************************************* //
