run/validationAnalytical/Hsu_Jeng/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#application="biotFoam"

runApplication blockMesh 
runApplication biotQSFoam  &

